/*Составьте программу, которая напечатает рисунок, используя символы из таблицы ASCII.
Преобразовать код символа в символ типа char можно, методом преобразования целого значения в символьное.
Используя оператор вывода cout необходимо подобрать нужный символ.*/

#include <iostream>
using namespace std;

int main()
{
	cout << " "<< char(201);
	cout << char(203) << char(203) << char(203) << char(203) << char(203) << char(203) << char(203) << char(187) << endl;
	cout << " " << char(200) << char(202) << char(202) << char(202) << char(202) << char(202) << char(202) << char(202) << char(188) << endl;
}


